## Scratch: app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 63 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.forms_s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "forms_s3"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.forms_secrets_manager will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "forms_secrets_manager"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:ca-central-1:722713121070:secret:server-database-url-XPW7mO",
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.lambda_app_invoke will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_app_invoke"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.lambda_s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_s3"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.lambda_secrets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_secrets"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:ca-central-1:722713121070:secret:database-secret-b8NYoW",
              + (known after apply),
            ]
        }
    }

  # data.template_file.form_viewer_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "form_viewer_task"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "METRIC_PROVIDER"
                          + value = "${metric_provider}"
                        },
                      + {
                          + name  = "TRACER_PROVIDER"
                          + value = "${tracer_provider}"
                        },
                      + {
                          + name  = "SUBMISSION_API"
                          + value = "${submission_api}"
                        },
                      + {
                          + name  = "TEMPLATES_API"
                          + value = "${templates_api}"
                        },
                      + {
                          + name  = "ORGANISATIONS_API"
                          + value = "${organisations_api}"
                        },
                      + {
                          + name  = "NEXTAUTH_URL"
                          + value = "${nextauth_url}"
                        },
                      + {
                          + name  = "REDIS_URL"
                          + value = "${redis_url}"
                        },
                      + {
                          + name  = "RELIABILITY_FILE_STORAGE"
                          + value = "${reliability_file_storage}"
                        },
                    ]
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + name             = "form_viewer"
                  + portMappings     = [
                      + {
                          + containerPort = 3000
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "NOTIFY_API_KEY"
                          + valueFrom = "${notify_api_key}"
                        },
                      + {
                          + name      = "GOOGLE_CLIENT_ID"
                          + valueFrom = "${google_client_id}"
                        },
                      + {
                          + name      = "GOOGLE_CLIENT_SECRET"
                          + valueFrom = "${google_client_secret}"
                        },
                      + {
                          + name      = "DATABASE_URL"
                          + valueFrom = "${database_url}"
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "awslogs-group"            = "Forms"
          + "awslogs-region"           = "ca-central-1"
          + "awslogs-stream-prefix"    = "ecs-form-viewer"
          + "database_url"             = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:server-database-url-XPW7mO"
          + "google_client_id"         = (known after apply)
          + "google_client_secret"     = (known after apply)
          + "image"                    = "722713121070.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_scratch"
          + "metric_provider"          = "stdout"
          + "nextauth_url"             = "https://forms-scratch.cdssandbox.xyz"
          + "notify_api_key"           = (known after apply)
          + "organisations_api"        = (known after apply)
          + "redis_url"                = "gcforms-redis-rep-group.tdwryw.ng.0001.cac1.cache.amazonaws.com"
          + "reliability_file_storage" = (known after apply)
          + "submission_api"           = (known after apply)
          + "templates_api"            = (known after apply)
          + "tracer_provider"          = "stdout"
        }
    }

  # aws_appautoscaling_policy.forms_cpu[0] will be created
  + resource "aws_appautoscaling_policy" "forms_cpu" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "forms_cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # aws_appautoscaling_policy.forms_memory[0] will be created
  + resource "aws_appautoscaling_policy" "forms_memory" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "forms_memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # aws_appautoscaling_target.forms[0] will be created
  + resource "aws_appautoscaling_target" "forms" {
      + id                 = (known after apply)
      + max_capacity       = 2
      + min_capacity       = 1
      + resource_id        = (known after apply)
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # aws_cloudwatch_log_group.forms will be created
  + resource "aws_cloudwatch_log_group" "forms" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:722713121070:key/d5d2549a-0261-47ae-9a63-5f77193098b1"
      + name              = "Forms"
      + retention_in_days = 90
      + tags              = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
    }

  # aws_codedeploy_app.app will be created
  + resource "aws_codedeploy_app" "app" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "ECS"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "AppECS-Forms-form-viewer"
      + tags_all            = (known after apply)
    }

  # aws_codedeploy_deployment_group.app will be created
  + resource "aws_codedeploy_deployment_group" "app" {
      + app_name               = "AppECS-Forms-form-viewer"
      + arn                    = (known after apply)
      + compute_platform       = (known after apply)
      + deployment_config_name = "CodeDeployDefault.ECSAllAtOnce"
      + deployment_group_id    = (known after apply)
      + deployment_group_name  = "DgpECS-Forms-form-viewer"
      + id                     = (known after apply)
      + service_role_arn       = (known after apply)
      + tags_all               = (known after apply)

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout = "CONTINUE_DEPLOYMENT"
            }

          + green_fleet_provisioning_option {
              + action = (known after apply)
            }

          + terminate_blue_instances_on_deployment_success {
              + action                           = "TERMINATE"
              + termination_wait_time_in_minutes = 1
            }
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }

      + ecs_service {
          + cluster_name = "Forms"
          + service_name = "form-viewer"
        }

      + load_balancer_info {

          + target_group_pair_info {
              + prod_traffic_route {
                  + listener_arns = [
                      + "arn:aws:elasticloadbalancing:ca-central-1:722713121070:listener/app/form-viewer/b38b35c33ee94a8f/82abc80e20e5b978",
                    ]
                }

              + target_group {
                  + name = "form-viewer"
                }
              + target_group {
                  + name = "form-viewer-2"
                }
            }
        }
    }

  # aws_ecs_cluster.forms will be created
  + resource "aws_ecs_cluster" "forms" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "Forms"
      + tags     = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.form_viewer will be created
  + resource "aws_ecs_service" "form_viewer" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "form-viewer"
      + platform_version                   = "1.4.0"
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "CODE_DEPLOY"
        }

      + load_balancer {
          + container_name   = "form_viewer"
          + container_port   = 3000
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:722713121070:targetgroup/form-viewer/098723f757a3773f"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-02fb7b8e24f1cbfac",
              + "sg-0ad2f0da68c1ee1c4",
            ]
          + subnets          = [
              + "subnet-0434222e4402d3250",
              + "subnet-09c3ce9dd3c216b1a",
              + "subnet-0e59716b8f5291336",
            ]
        }
    }

  # aws_ecs_task_definition.form_viewer will be created
  + resource "aws_ecs_task_definition" "form_viewer" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2048"
      + execution_role_arn       = (known after apply)
      + family                   = "form-viewer"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_iam_policy.forms_s3 will be created
  + resource "aws_iam_policy" "forms_s3" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "formsS3Access"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.forms_secrets_manager will be created
  + resource "aws_iam_policy" "forms_secrets_manager" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "formsSecretsManagerKeyRetrieval"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_app_invoke will be created
  + resource "aws_iam_policy" "lambda_app_invoke" {
      + arn         = (known after apply)
      + description = "IAM policy for allowing the Forms app to invoke Lambda functions"
      + id          = (known after apply)
      + name        = "lambda_app_invoke"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_dynamodb will be created
  + resource "aws_iam_policy" "lambda_dynamodb" {
      + arn         = (known after apply)
      + description = "IAM policy for storing Form responses in DynamoDB"
      + id          = (known after apply)
      + name        = "lambda_dynamobdb"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:BatchWriteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:ca-central-1:722713121070:table/Vault",
                          + "arn:aws:dynamodb:ca-central-1:722713121070:table/ReliabilityQueue",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_kms will be created
  + resource "aws_iam_policy" "lambda_kms" {
      + arn         = (known after apply)
      + description = "IAM policy for storing encrypting and decrypting data"
      + id          = (known after apply)
      + name        = "lambda_kms"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:GenerateDataKey",
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:ca-central-1:722713121070:key/e53bff47-6a78-4484-9cda-ebb202b016f1"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn         = (known after apply)
      + description = "IAM policy for logging from a lambda"
      + id          = (known after apply)
      + name        = "lambda_logging"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_rds will be created
  + resource "aws_iam_policy" "lambda_rds" {
      + arn         = (known after apply)
      + description = "IAM policy for allowing acces to DB"
      + id          = (known after apply)
      + name        = "lambda_rds"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "tag:GetResources",
                          + "secretsmanager:ListSecrets",
                          + "secretsmanager:GetRandomPassword",
                          + "secretsmanager:CreateSecret",
                          + "rds-data:RollbackTransaction",
                          + "rds-data:ExecuteStatement",
                          + "rds-data:ExecuteSql",
                          + "rds-data:CommitTransaction",
                          + "rds-data:BeginTransaction",
                          + "rds-data:BatchExecuteStatement",
                          + "dbqms:UpdateQueryHistory",
                          + "dbqms:UpdateFavoriteQuery",
                          + "dbqms:GetQueryString",
                          + "dbqms:DescribeQueryHistory",
                          + "dbqms:DescribeFavoriteQueries",
                          + "dbqms:DeleteQueryHistory",
                          + "dbqms:DeleteFavoriteQueries",
                          + "dbqms:CreateQueryHistory",
                          + "dbqms:CreateFavoriteQuery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "RDSDataServiceAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_s3 will be created
  + resource "aws_iam_policy" "lambda_s3" {
      + arn         = (known after apply)
      + description = "IAM policy for storing files in S3"
      + id          = (known after apply)
      + name        = "lambda_s3"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_secrets will be created
  + resource "aws_iam_policy" "lambda_secrets" {
      + arn         = (known after apply)
      + description = "IAM policy for accessing secret manager"
      + id          = (known after apply)
      + name        = "lambda_secrets"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_sqs will be created
  + resource "aws_iam_policy" "lambda_sqs" {
      + arn         = (known after apply)
      + description = "IAM policy for sending messages through SQS"
      + id          = (known after apply)
      + name        = "lambda_sqs"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sqs:SendMessage",
                          + "sqs:ReceiveMessage",
                          + "sqs:GetQueueAttributes",
                          + "sqs:DeleteMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sqs:*:*:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.codedeploy will be created
  + resource "aws_iam_role" "codedeploy" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codedeploy"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.forms will be created
  + resource "aws_iam_role" "forms" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "form-viewer"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.codedeploy will be created
  + resource "aws_iam_role_policy_attachment" "codedeploy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS"
      + role       = "codedeploy"
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_forms will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_forms" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "form-viewer"
    }

  # aws_iam_role_policy_attachment.lambda_dynamodb will be created
  + resource "aws_iam_role_policy_attachment" "lambda_dynamodb" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_kms will be created
  + resource "aws_iam_role_policy_attachment" "lambda_kms" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_rds will be created
  + resource "aws_iam_role_policy_attachment" "lambda_rds" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_s3 will be created
  + resource "aws_iam_role_policy_attachment" "lambda_s3" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_secrets will be created
  + resource "aws_iam_role_policy_attachment" "lambda_secrets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_sqs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_sqs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.s3_forms will be created
  + resource "aws_iam_role_policy_attachment" "s3_forms" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "form-viewer"
    }

  # aws_iam_role_policy_attachment.secrets_manager_forms will be created
  + resource "aws_iam_role_policy_attachment" "secrets_manager_forms" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "form-viewer"
    }

  # aws_lambda_event_source_mapping.reliability will be created
  + resource "aws_lambda_event_source_mapping" "reliability" {
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:ca-central-1:722713121070:submission_processing.fifo"
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # aws_lambda_function.organisations will be created
  + resource "aws_lambda_function" "organisations" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/organisations_main.zip"
      + function_name                  = "Organisations"
      + handler                        = "organisations.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "HEaYM+wSkzD9IqfJijAS6eTLOmItfqg7UMGdcadEugE="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_ARN"    = "arn:aws:rds:ca-central-1:722713121070:cluster:forms-db-cluster"
              + "DB_NAME"   = "forms"
              + "DB_SECRET" = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:database-secret-b8NYoW"
              + "REGION"    = "ca-central-1"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.reliability will be created
  + resource "aws_lambda_function" "reliability" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/reliability_main.zip"
      + function_name                  = "Reliability"
      + handler                        = "reliability.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "kKVXUTOl7bxkXyVCDpHfYHCwp9TYSOmd4VZMDOF+4bg="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT"    = "scratch"
              + "NOTIFY_API_KEY" = (sensitive)
              + "REGION"         = "ca-central-1"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.retrieval will be created
  + resource "aws_lambda_function" "retrieval" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/retrieval_main.zip"
      + function_name                  = "Retrieval"
      + handler                        = "retrieval.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "RlmK/g1kRRHU/YVN2D6mFYs9BI5iEsejl/euOkwl02U="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_ARN"    = "arn:aws:rds:ca-central-1:722713121070:cluster:forms-db-cluster"
              + "DB_NAME"   = "forms"
              + "DB_SECRET" = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:database-secret-b8NYoW"
              + "REGION"    = "ca-central-1"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.submission will be created
  + resource "aws_lambda_function" "submission" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/submission_main.zip"
      + function_name                  = "Submission"
      + handler                        = "submission.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "utsw1p1B1FGxoyhkFkWrwcgzzBUdUy+gDAk892EOk9o="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "REGION"  = "ca-central-1"
              + "SQS_URL" = "https://sqs.ca-central-1.amazonaws.com/722713121070/submission_processing.fifo"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.templates will be created
  + resource "aws_lambda_function" "templates" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/templates_main.zip"
      + function_name                  = "Templates"
      + handler                        = "templates.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "O/xGXIXLP/lOC025krZz0J8+U3pVAxJtC+2ygfEDv2I="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_ARN"    = "arn:aws:rds:ca-central-1:722713121070:cluster:forms-db-cluster"
              + "DB_NAME"   = "forms"
              + "DB_SECRET" = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:database-secret-b8NYoW"
              + "REGION"    = "ca-central-1"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_layer_version.organisations_lib will be created
  + resource "aws_lambda_layer_version" "organisations_lib" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs12.x",
          + "nodejs14.x",
        ]
      + created_date                = (known after apply)
      + filename                    = "/tmp/organisations_lib.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "organisations_node_packages"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = "LJXoZ4/CtDEeZbVzNQX594g+onErSOp+rmhPhTRpDtE="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_layer_version.reliability_lib will be created
  + resource "aws_lambda_layer_version" "reliability_lib" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs12.x",
          + "nodejs14.x",
        ]
      + created_date                = (known after apply)
      + filename                    = "/tmp/reliability_lib.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "reliability_lib_packages"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = "aVzcNZgfDR/m+FOYIae21XLj7xCRxMni+4mLFIPJKYc="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_layer_version.reliability_nodejs will be created
  + resource "aws_lambda_layer_version" "reliability_nodejs" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs12.x",
          + "nodejs14.x",
        ]
      + created_date                = (known after apply)
      + filename                    = "/tmp/reliability_nodejs.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "reliability_node_packages"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = "9UVIJQZuRQoMQwOjDVdLWtzuSudKInitTpvouUW3hPc="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_layer_version.retrieval_lib will be created
  + resource "aws_lambda_layer_version" "retrieval_lib" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs12.x",
          + "nodejs14.x",
        ]
      + created_date                = (known after apply)
      + filename                    = "/tmp/retrieval_lib.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "retrieval_node_packages"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = "T5adV+haDOLZxPNGdpGALsnmoYZKYBrvVuOBKTbfp3o="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_layer_version.submission_lib will be created
  + resource "aws_lambda_layer_version" "submission_lib" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs12.x",
          + "nodejs14.x",
        ]
      + created_date                = (known after apply)
      + filename                    = "/tmp/submission_lib.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "submission_node_packages"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = "LZCAV2cLcAPN9tdbQTeS13cX+2ROXn1x9dtcRXVLOy8="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_layer_version.templates_lib will be created
  + resource "aws_lambda_layer_version" "templates_lib" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs12.x",
          + "nodejs14.x",
        ]
      + created_date                = (known after apply)
      + filename                    = "/tmp/templates_lib.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "templates_node_packages"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = "QAFbSfEcl0mIzHOpJmhNXZ0qgZHue5WO0B/XIXC+KvE="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_permission.internal_templates will be created
  + resource "aws_lambda_permission" "internal_templates" {
      + action        = "lambda:InvokeFunction"
      + function_name = "Templates"
      + id            = (known after apply)
      + principal     = (known after apply)
      + statement_id  = "AllowInvokeLambda"
    }

  # aws_lambda_permission.organisations will be created
  + resource "aws_lambda_permission" "organisations" {
      + action        = "lambda:InvokeFunction"
      + function_name = "Organisations"
      + id            = (known after apply)
      + principal     = (known after apply)
      + statement_id  = "AllowInvokeECS"
    }

  # aws_lambda_permission.retrieval will be created
  + resource "aws_lambda_permission" "retrieval" {
      + action        = "lambda:InvokeFunction"
      + function_name = "Retrieval"
      + id            = (known after apply)
      + principal     = (known after apply)
      + statement_id  = "AllowInvokeECS"
    }

  # aws_lambda_permission.submission will be created
  + resource "aws_lambda_permission" "submission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "Submission"
      + id            = (known after apply)
      + principal     = (known after apply)
      + statement_id  = "AllowInvokeECS"
    }

  # aws_lambda_permission.templates will be created
  + resource "aws_lambda_permission" "templates" {
      + action        = "lambda:InvokeFunction"
      + function_name = "Templates"
      + id            = (known after apply)
      + principal     = (known after apply)
      + statement_id  = "AllowInvokeECS"
    }

  # aws_s3_bucket.archive_storage will be created
  + resource "aws_s3_bucket" "archive_storage" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "forms-scratch-archive-storage"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 30
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.reliability_file_storage will be created
  + resource "aws_s3_bucket" "reliability_file_storage" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "forms-scratch-reliability-file-storage"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 5
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.vault_file_storage will be created
  + resource "aws_s3_bucket" "vault_file_storage" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "forms-scratch-vault-file-storage"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.archive_storage will be created
  + resource "aws_s3_bucket_public_access_block" "archive_storage" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.reliability_file_storage will be created
  + resource "aws_s3_bucket_public_access_block" "reliability_file_storage" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.vault_file_storage will be created
  + resource "aws_s3_bucket_public_access_block" "vault_file_storage" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_secretsmanager_secret.google_client_id will be created
  + resource "aws_secretsmanager_secret" "google_client_id" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "google_client_id"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret.google_client_secret will be created
  + resource "aws_secretsmanager_secret" "google_client_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "google_client_secret"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret.notify_api_key will be created
  + resource "aws_secretsmanager_secret" "notify_api_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "notify_api_key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret_version.google_client_id will be created
  + resource "aws_secretsmanager_secret_version" "google_client_id" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.google_client_secret will be created
  + resource "aws_secretsmanager_secret_version" "google_client_secret" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.notify_api_key will be created
  + resource "aws_secretsmanager_secret_version" "notify_api_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 63 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_codedeploy_app.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_codedeploy_deployment_group.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.google_client_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.google_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.notify_api_key"]

13 tests, 8 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
